package ru.javamarathon.day1;

/**
 * @author  Nikolas Pavlov
 *
 * Вывести на экран слово "JAVA", в столбик, чтобы оно повторилось 10 раз, используя for
 */

public class Task3
{
    public static void main(String[] args)
    {
        for (int i = 0; i < 10; i++)
        {
            System.out.println("JAVA");

        }

    }
}
